import Table from "./Table";

const ExamSchedule = () => {
      const columns = [
        {
          name: 'Назва предмету'
        },
        {
          name: 'Тип контролю',
        },
        {
          name: 'Дата',
        },
        {
          name: 'Час',
        },
        {
          name: 'Авдиторія',
        },
      ];
    
      const data = [
        ['Дискретна математика', 'Залік', '10/12/2023', "09:30", 206],
        ['Додаткові розділи C++', 'Залік', '12/12/2023', "08:30", 204],
        ["Об'єктно орієнтоване програмування", 'Екзамен', '14/12/2023', "09:30", 106],
        ['Англійська мова', 'Залік', '15/12/2023', "09:30", 206],
        ['Теорія ймовірностей', 'Екзамен', '18/12/2023', "10:30", 208],

      ];
    
    return (
      <div className="exam-schedule">
        <Table columns={columns} data={data}/>
      </div>
    );
};

export default ExamSchedule;